# 1. Сумма трех Посчитайте сумму трех введенных целых чисел

# a = int (input ('Введите число a:'))
# b = int (input ('Введите число b:'))
# c = int (input ('Введите число c:'))

# print (a + b + c)



# 2. Площадь Пользователь вводит стороны прямоугольника, 
# выведите его площадь

# a = int (input ('Введите число a:'))
# b = int (input ('Введите число b:'))


# print (a * b)




# 3. 1. Одинаковая четность Даны два целых числа: A, B. 
# Проверить истинность высказывания: "Числа A и B имеют 
# одинаковую четность".

# a = int (input ('Введите число a:'))
# b = int (input ('Введите число b:'))

# print (a % 2 == b % 2)



# 4. Одно положительное Даны три целых числа: A, B, C. 
# Проверить истинность высказывания: "Хотя бы одно из 
# чисел A, B, C положительное".

# a = int (input ('Введите число a:'))
# b = int (input ('Введите число b:'))
# c = int (input ('Введите число c:'))

# print (a > 0 or b > 0 or c > 0)

# 5 Меньшее из двух Пользователь вводит два целых числа. 
# Выведите меньшее из них. 

# a = int (input ('Введите число a:'))
# b = int (input ('Введите число b:'))

# if a > b :
#     print (b)
# else:
#     print (a)

# 6.Четырехзначное? Пользователь вводит целое число. 
# Выведите YES, если это число является четырехзначным,
# и NO в противном случае.

# a = int (input ('Введите число a:'))
# if 999 < a < 10000 or -10000 < a < -999 :
#     print ('YES')
# else :
#     print ('NO')